### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load
myfile = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
myfile_df = pd.read_csv(myfile)
# pd.options.display.float_format = '${:,.2f}'.format

In [2]:
myfile_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
total_players = myfile_df["SN"].nunique()
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
unique_items = myfile_df["Item Name"].nunique()
unique_items

179

In [5]:
purchase_count = myfile_df["Item Name"].count()
purchase_count

780

In [6]:
avg_price = round(myfile_df["Price"].mean(), 2)
avg_price

3.05

In [7]:
total_revenue = round(myfile_df["Price"].sum(), 2)
total_revenue

2379.77

In [8]:
# Create a summary data frame to hold the results
summary_table_df = pd.DataFrame({'Number of Unique Items': [unique_items], 
                                 'Average Price': "$"+str(avg_price),
                                 'Number of Purchases': (purchase_count),
                                 'Total Revenue': "$"+str(total_revenue)})
summary_table_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
# Count of gender
gender_counts = myfile_df["Gender"].value_counts()
gender_counts

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [15]:
reduced_df = myfile_df.loc[:, ["Gender", "SN"]]
reduced_df

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
775  Female     Aethedru70
776    Male         Iral74
777    Male     Yathecal72
778    Male        Sisur91
779    Male      Ennrian78

[780 rows x 2 columns]

In [17]:
new_df = reduced_df.drop_duplicates()
new_df

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
773    Male         Hala31
774    Male     Jiskjask80
775  Female     Aethedru70
777    Male     Yathecal72
778    Male        Sisur91

[576 rows x 2 columns]

In [10]:
grouped_gender_df = myfile_df.groupby("Gender")

# print(grouped_gender_df)

grouped_gender_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [ ]:
price_per_person = grouped_gender_df["Price"].mean()
round((price_per_person), 2)

In [ ]:
# # male_percent = count_of_males / total_players * 100
# # male_percent

# # Calculations can also be performed on Series and added into DataFrames as new columns
# thousands_of_dollars = myfile_df["Price"].mean()
# myfile_df["Thousands of Dollars"] = thousands_of_dollars

# myfile_df.head()

In [29]:
######################## Need to return a count of unique male users based on 'SN'(screen name)
count_of_males = (new_df["Gender"] == "Male").sum()
# count_of_males = count_of_males.sum()
count_of_males

484

In [30]:
######################## Need to return a count of unique female users based on 'SN'(screen name) 
count_of_females = (new_df["Gender"] == "Female").sum()
count_of_females

81

In [31]:
######################## Need to return a count of unique 'other' users based on 'SN'(screen name)
count_of_other = (new_df["Gender"] == "Other / Non-Disclosed").sum()
count_of_other

11

In [33]:
percent_male = count_of_males / total_players * 100
percent_male

84.02777777777779

In [34]:
percent_female = count_of_females / total_players
percent_female

0.140625

In [35]:
percent_other = count_of_other / total_players
percent_other

0.019097222222222224

In [38]:
grouped_age_df = grouped_gender_df["Age"].mean()
grouped_age_df

Gender
Female                   21.345133
Male                     22.917178
Other / Non-Disclosed    24.200000
Name: Age, dtype: float64

In [36]:
grouped_avg_price = grouped_gender_df["Price"].mean()
grouped_avg_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [37]:
grouped_purchase_count = grouped_gender_df["Item Name"].count()
grouped_purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [39]:
grouped_purchase_value = grouped_gender_df["Price"].sum()
grouped_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [40]:
############## need HELP - these values should return avg purchase price PER PERSON
grouped_avg_total = grouped_gender_df["Price"].mean()
grouped_avg_total

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64


* The below each broken by gender

* Purchase Count

* Average Purchase Price

* Total Purchase Value

* Average Purchase Total per Person by Gender

In [51]:
unique_gender_totals = myfile_df.groupby(["SN", "Gender", "Price"])
unique_gender_totals.sum()
unique_gender_totals

In [50]:
unique_gender_totals.mean()
unique_gender_totals.describe()

                          Purchase ID                                         \
                                count   mean std    min    25%    50%    75%
SN           Gender Price
Adairialis76 Male   2.28          1.0  467.0 NaN  467.0  467.0  467.0  467.0
Adastirin33  Female 4.48          1.0  142.0 NaN  142.0  142.0  142.0  142.0
Aeda94       Male   4.91          1.0  388.0 NaN  388.0  388.0  388.0  388.0
Aela59       Male   4.32          1.0   28.0 NaN   28.0   28.0   28.0   28.0
Aelaria33    Male   1.79          1.0  630.0 NaN  630.0  630.0  630.0  630.0
...                               ...    ...  ..    ...    ...    ...    ...
Zhisrisu83   Male   3.54          1.0  141.0 NaN  141.0  141.0  141.0  141.0
                    4.35          1.0   54.0 NaN   54.0   54.0   54.0   54.0
Zontibe81    Male   1.76          1.0   17.0 NaN   17.0   17.0   17.0   17.0
                    2.48          1.0  560.0 NaN  560.0  560.0  560.0  560.0
                    3.79          1.0  442.0 NaN  442.0  442.0  442.0  442.0

                                   Age        ...             Item ID         \
                             max count  mean  ...   75%   max   count   mean
SN           Gender Price                     ...
Adairialis76 Male   2.28   467.0   1.0  16.0  ...  16.0  16.0     1.0  123.0
Adastirin33  Female 4.48   142.0   1.0  35.0  ...  35.0  35.0     1.0  175.0
Aeda94       Male   4.91   388.0   1.0  17.0  ...  17.0  17.0     1.0  128.0
Aela59       Male   4.32    28.0   1.0  21.0  ...  21.0  21.0     1.0  119.0
Aelaria33    Male   1.79   630.0   1.0  23.0  ...  23.0  23.0     1.0  171.0
...                          ...   ...   ...  ...   ...   ...     ...    ...
Zhisrisu83   Male   3.54   141.0   1.0  10.0  ...  10.0  10.0     1.0   60.0
                    4.35    54.0   1.0  10.0  ...  10.0  10.0     1.0   25.0
Zontibe81    Male   1.76    17.0   1.0  21.0  ...  21.0  21.0     1.0  161.0
                    2.48   560.0   1.0  21.0  ...  21.0  21.0     1.0    2.0
                    3.79   442.0   1.0  21.0  ...  21.0  21.0     1.0   84.0


                          std    min    25%    50%    75%    max
SN           Gender Price
Adairialis76 Male   2.28  NaN  123.0  123.0  123.0  123.0  123.0
Adastirin33  Female 4.48  NaN  175.0  175.0  175.0  175.0  175.0
Aeda94       Male   4.91  NaN  128.0  128.0  128.0  128.0  128.0
Aela59       Male   4.32  NaN  119.0  119.0  119.0  119.0  119.0
Aelaria33    Male   1.79  NaN  171.0  171.0  171.0  171.0  171.0
...                        ..    ...    ...    ...    ...    ...
Zhisrisu83   Male   3.54  NaN   60.0   60.0   60.0   60.0   60.0
                    4.35  NaN   25.0   25.0   25.0   25.0   25.0
Zontibe81    Male   1.76  NaN  161.0  161.0  161.0  161.0  161.0
                    2.48  NaN    2.0    2.0    2.0    2.0    2.0
                    3.79  NaN   84.0   84.0   84.0   84.0   84.0

[779 rows x 24 columns]

In [43]:
############################ Avg Purchase Price is NAN?! ########################
# Create a summary data frame to hold the results by gender
gender_summary_df = pd.DataFrame({'Avg Age': round((grouped_age_df), 1).astype(float).map("{:,.1f}".format),
                                  'Purchase Count': (grouped_purchase_count),
                                  'Average Purchase Price': round((grouped_avg_price),2).astype(float).map("${:,.2f}".format),
                                  'Total Purchase Value': (grouped_purchase_value).astype(float).map("${:,.2f}".format),
                                   'Avg Purchase Total per Person': round((grouped_avg_total), 2).astype(float).map("${:,.2f}".format)
                                })
gender_summary_df

,Avg Age,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Purchase Total per Person
Gender,,,,,
Female,21.3,113,$3.20,$361.94,$3.20
Male,22.9,652,$3.02,"$1,967.64",$3.02
Other / Non-Disclosed,24.2,15,$3.35,$50.19,$3.35

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [52]:
# Figure out the min and max age values so we know what the edges are
print(myfile_df["Age"].max())
print(myfile_df["Age"].min())

45
7

In [62]:
########################## HELP with binning #################
# Create bins for Ages
bins = [1, 10, 15, 20, 25, 30, 35, 40, 45]

group_labels = ["<10", "10 to 14", "15 to 19", "20 to 24", "25 to 29", "30 to 34", "35 to 39", "40+"]

In [ ]:
len(bins)

In [ ]:
len(group_labels)

In [ ]:
# Slice the data and place it into bins
# pd.cut(myfile_df["Age"], bins, labels=group_labels).head()

In [63]:
# Create a group based off of the bins
age_bin_df = myfile_df.groupby("Age")
age_bin_df

In [64]:
# Categorize the existing players by adding a new column to the data frame
myfile_df["Age Range"] = pd.cut(myfile_df["Age"], bins, labels=group_labels, include_lowest=True)
myfile_df.head(20)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15 to 19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35 to 39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 to 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 to 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 to 24
5,5,Yalae81,22,Male,81,Dreamkiss,3.61,20 to 24
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35 to 39
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,15 to 19
8,8,Undjask33,22,Male,21,Souleater,1.10,20 to 24
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,30 to 34
10,10,Inguron55,23,Male,95,Singed Onyx Warscythe,4.74,20 to 24
11,11,Haisrisuir60,23,Male,162,Abyssal Shard,2.67,20 to 24
12,12,Saelaephos52,21,Male,116,Renewed Skeletal Katana,4.18,20 to 24
13,13,Assjaskan73,22,Male,4,Bloodlord's Fetish,1.70,20 to 24
14,14,Saesrideu94,35,Male,165,Bone Crushing Silver Skewer,4.86,30 to 34
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89,20 to 24
16,16,Lisirra25,20,Male,40,Second Chance,2.52,15 to 19
17,17,Zontibe81,21,Male,161,Devine,1.76,20 to 24
18,18,Reunasu60,22,Female,82,Nirvana,4.90,20 to 24
19,19,Chamalo71,30,Male,89,"Blazefury, Protector of Delusions",4.64,25 to 29

In [76]:
################### need HELP counting unique values - there are duplicates in the data file #################

# Calculate the numbers and percentages for each age group
type(myfile_df["Age Range"])
myfile_df["Age Range"].groupeby("Age Range")

0      15 to 19
1      35 to 39
2      20 to 24
3      20 to 24
4      20 to 24
         ...
775    20 to 24
776    20 to 24
777    15 to 19
778         <10
779    20 to 24
Name: Age Range, Length: 780, dtype: category
Categories (8, object): [<10 < 10 to 14 < 15 to 19 < 20 to 24 < 25 to 29 < 30 to 34 < 35 to 39 < 40+]

In [77]:
myfile_df["Age Range"].count()

780

In [ ]:
######################################### HELP ######################
# Create a summary data frame to hold the results and display it
gender_ranges_df = pd.DataFrame({"Total Count": [bin_counts]
#                                  'Percentage of Players': (age_range),
                                })
gender_ranges_df

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
# Retrieve ID, Item Name, Item Price columns
new_df = myfile_df[["Item ID", "Item Name", "Price"]]
new_df.head()

In [ ]:
# Group by 'ID' and 'Item Name' and perform calcs to obtain:
# Purchase Count
# Avg Item Price
# Total purchase Value

grouped_items = myfile_df.groupby(["Item ID", "Item Name"])
grouped_items.mean()

In [ ]:
# Create a summary data frame to hold the results
popular_items_df = pd.DataFrame({""})

In [ ]:
# Sort Purchase Count in Decending order and preview the data frame
purchase_count = myfile_df.sort_values("Price", ascending=False)
purchase_count.head()

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
# Sort the above table by Total Purchase Value in Decending order
total_value = myfile_df.sort_values("Price", ascending=False)
total_value.head()